create_clock -name clk -period 5 -waveform {0 2.5} [get_ports clk]
set_clock_transition -rise 0.05 [get_clocks clk]
set_clock_transition -fall 0.05 [get_clocks clk]
set_clock_uncertainty 0.01 [get_ports clk]
set_input_delay -max 0.05 [get_ports rst_n] -clock [get_clocks clk]
set_output_delay -max 0.05 [get_ports iter_count] -clock [get_clocks clk]
